# Introduction

## How to use the exercise files

We are using SQLiteStudio for this course. 
- Once downloaded, to open hold control then right click and select open. 
- Hit control + o to open a new database. Navigate to where the exercise files are stored and open each
- hit the button that looks like a piece of paper with a pencil on it to open the editor
### TO EXECUTE QUERY MUST HIGHLIGHT CODE WANT TO EXECUTE AND PRESS PLAY OR F9

To select data from a table type: SELECT * FROM Table Name; 
then hit the play button

In [ ]:
SELECT * FROM Table Name;

# SQL Overview

In [ ]:
SELECT * FROM Countries WHERE Continent = 'Europe';   # says select rows from Continent table where content column is populated with 
                                                      # Europe

In [ ]:
CRUD - four fundamental functions of a DB system

Create 
Read
Update 
Delete

In [ ]:
Insert INTO Customer (name, city, state)
    VALUES ('Jimi Hendrix', 'Renton', 'WA'); # the indentation signifies taht it is part of the same line of code as above. This is
                                             # just moved down to improve readability

In [ ]:
UPDATE Customer
    SET
        Address = '123 Music Avenue',
        Zip = '98988'
    WHERE id = 5;

In [ ]:
DELETE FROM Customer WHERE id = 4;

## Database organization

DB is made up of a table or many tables. tables are made up of rows and columns. Primary key is the column that is used as the key for the table

In [ ]:
# The select statement returns results or a set of results from a query.
SELECT 'Hello World';

# Can use the AS keyword to give a column a name.

SELECT 'Hello World' AS Result;

# This will return a single row with a single column with Result as the column name and Hello World in the cell 

SELECT * FROM Country; 

# This will return all rows and all columns from the Country table.

SELECT * FROM Country ORDER BY Name;

# This will return all rows from the Country table and sort them by the Name column.

SELECT Name, LifeExpectancy AS "Life Expectancy" FROM Country ORDER BY Name;

# This will return all rows from the Country Table in the Name and LifeExpectancy columns and sort them by the Name column.
# Notice the use of double quotes around Life Expectancy. This is because we are alling the column to be called Life Expectancy.

## Selectring Rows

In [ ]:
SELECT Name, Continent, Region From Country WHERE Continent = 'Europe';
# This will return all rows from the Country table in the Name, Continent and Region columns and only return rows where the Continent column is populated with Europe.

SELECT Name, Continent, Region From Country WHERE Continent = 'Europe'; ORDER BY Name LIMIT 5 OFFSET 10;
# This will return all rows from the Country table in the Name, Continent and Region columns and only return rows where the Continent column is populated with Europe 
# AND sort them by the Name colum while limiting the number of rows to 5 and starting at row 10.

## Selecting Columns

In [ ]:
SELECT Name AS Country, Continent, Region FROM Country;
# This will return all rows from the Country table in the Name, Continent and Region columns from the Country table and rename the Name column to Country.

## Counting Rows

In [ ]:
SELECT COUNT (*) FROM Country;
# This will return the number of rows in the Country table.

SELECT COUNT (*) FROM Country WHERE Population > 1000000;
# This will return the number of rows in the Country table where the Population column is greater than 1,000,000.

SELECT COUNT (*) FROM Country WHERE Population > 1000000 AND Continent = 'Europe';
# This will return the number of rows in the Country table where the Population column is greater than 1,000,000 AND the Continent column is populated with Europe.

# The * is a special case and means count all rows in the table.
# If instead of the * we specify a column like below: 
SELECT COUNT (LifeExpectancy) FROM Country;
# This will return the number of rows in the Country table where the LifeExpectancy column is populated.

## Inserting Data

In [ ]:
SELECT * FROM customer; 

INSERT INTO customer (name, address, city state, zip)
    VALUES ('Fred Flinstone', '123 Bedrock', 'Bedrock', 'WA', '99999');

# here we are selecting all rows from the customer table and inserting a new row into the customer table with the values from the VALUES clause.

# we can also insert a new row and only populate some fo the columns. The areas that are not populated will be populated with NULL.
INSERT INTO customer (name, city, state )
    VALUES ('Jimi Hendrix', 'Renton', 'WA');

## Updating Data

In [ ]:
SELECT * FROM customer;

UPDATE customer SET address = '123 Music Avenue', zip = '98988' WHERE id = 5;
# This will update the address and zip columns of the customer table where the id column is populated with 5.

UPDATE customer SET address = '2603 S Washington ST', zip = '98000' WHERE id = 5; # the id number is the index of the row in the table so it will only 
                                                                                  # change this information for that row 

UPDATE customer SET address = NULL, zip = NULL WHERE id = 5; # this will set the address and zip columns to NULL where the id column is populated with 5.

## Deleting Data

In [ ]:
SELECT * FROM customer WHERE id = 4;
# This will return all rows from the customer table where the id column is populated with 4, so it will return only one row.

DELETE FROM customer WHERE id = 4;
SELECT * FROM customer;
# This will delete the row from the customer table where the id column is populated with 4.

DELETE FROM customer WHERE id = 5;
SELECT * FROM customer;
# This will delete the row from the customer table where the id column is populated with 5.